Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE/tmx_teil_2.tmx
Source language: de
Languages: en

source: Spannvorrichtungen zur endlosen Kraftübertragung [ausgenommen für Landfahrzeuge]
en: Tensioning devices for endless drive power transmissions [other than for land vehicles]

source: Spannvorrichtungen zur endlosen Kraftübertragung [Maschinenteile]
en: Tensioning devices for endless drive power transmissions [parts of machines]

source: Gasbetriebene Schweißbrenner
en: Thermic torches (Gas operated -)

source: Drosselventile, nicht aus Metall, als Maschinenteile
en: Butterfly valves (Non-metallic -) being parts of machines

source: Drosselventile aus Metall [Maschinenteile]
en: Butterfly valves of metal being parts of machines

source: Kabelzylinder [Maschinenteile]
en: Cable cylinders [parts of machines]

source: Fräsmaschinen [zur Metallbearbeitung]
en: Milling machines [for metalworking]

source: Getreidemischer [Maschinen]
en: Grain mixers [machines]

source: Maschinen zum Einführen von Gegenständen in Ballons
en: Machines for inserting objects into balloons

source: Turbinenflügel, ausgenommen für Landfahrzeugmotoren
en: Turbine vanes, other than parts of land vehicle engines

source: Türme mit sich radial erstreckenden Werkzeugmaschinen
en: Turrets with radially extending machine tools

source: Kupplungen und Riemen zur Kraftübertragung [ausgenommen für Landfahrzeuge]
en: Machine couplings and transmissions, except for land vehicles

source: Elektromechanische Maschinen für die chemische Industrie
en: Electromechanical machines for chemical industry

source: Lineare Transfermaschinen
en: Linear transfer machines

source: Flüssigkeitsbelüfter [Maschinen]
en: Liquid aerators [machines]

source: Reibungsfreie Antriebsteile für Maschinen
en: Frictional drive components for machines

source: Leisten für Schneidwerkzeuge [Maschinenteile]
en: Cutting tool blocks [parts of machines]

source: Silageverteiler [Maschinen]
en: Silage spreaders [machines]

source: Punktschneidwerkzeuge [Maschinen]
en: Single point cutting tools [machines]

source: Magnetische Positionierer [Maschinenteile]
en: Magnetic positioners [parts of machines]

source: Notstromaggregate, -generatoren
en: Emergency power generators

source: Griffe als Teile von Werkzeugmaschinen
en: Handles being parts of machine tools

source: Griffe als Teile von mechanisch betätigten Werkzeugen
en: Handles being parts of mechanically operated tools

source: Vorsatzteile für Elektrowerkzeuge
en: Head attachments for power tools

source: Betätigungsmechanismen zum Bedienen von Vorflügeln
en: Actuating mechanisms for controlling slats

source: Kraftbetätigte Sprühgeräte für Insektizide
en: Power-operated sprayers for insecticides

source: Propeller für Maschinen
en: Propellers for machines

source: Kipphebel [Maschinenteile]
en: Rocker arms [parts of engines]

source: Filtergehäuse als Teile von Maschinen
en: Filter housings being parts of machines

source: Schaltgetriebe als Teile von Maschinen
en: Gear boxes being parts of machines

source: Gangschaltmechanismen für Maschinen
en: Gear changing mechanisms for machines

source: Maschinen zum Verschließen von Verpackungsbehältern
en: Machines for sealing packaging containers

source: Maschinen zum Ablösen von Tapeten
en: Machines for stripping wallcoverings

source: Sortiermaschinen für chemische Verfahren
en: Sorting machines [for chemical processing]

source: Verteilerläufer [Teile von Verbrennungsmotoren]
en: Distributor rotors [internal combustion engine parts]

source: Pantographengesteuerte Graviermaschinen
en: Pantograph controlled machines for engraving

source: Kraftübertragungsriemen für landwirtschaftliche Maschinen
en: Power transmission belts for agricultural machines

source: Kraftübertragungsmechanismen [ausgenommen für Landfahrzeuge]
en: Power transmission mechanisms [other than for land vehicles]

source: Kraftübertragungsvorrichtungen [ausgenommen für Landfahrzeuge]
en: Power transmissions [other than for land vehicles]

source: Elektrische Dosenöffner
en: Tin openers, electric

source: Drahtbürsten zur Verwendung in Maschinen
en: Wire brushes for use in machines

source: Wellenkupplungen [Maschinen]
en: Shaft couplings [machines]

source: Luftgekühlte Kondensatoren
en: Air-cooled condensers

source: Bohrfutter [Maschinenteile]
en: Drill chucks [parts of machines]

source: Wellenlager für Vakuumpumpen
en: Shaft bearings for vacuum pumps

source: Nockenwellenräder als Fahrzeugteile
en: Cam sprockets, being engine timing components

source: Schlitten für Strickmaschinen
en: Sliders for knitting machines

source: Pneumatische Antriebsgeräte
en: Pneumatic actuating apparatus

source: Mechanisch betätigte Verschlüsse für Erdölbohrlöcher
en: Mechanically operated stoppers for use in oil well applications

source: Metallschneidewerkzeuge [Maschinenteile]
en: Metal cutting tools [parts of machines]

source: Federn als Teile von Antivibrationshalterungen für Maschinen
en: Springs being parts of anti-vibration mountings for machines

source: Luftkondensatoren [Kompressoren]
en: Air condensers [compressors]

source: Maschinen zur Kartonherstellung
en: Machines for carton-making

source: Diamant-Schneidwerkzeug für Maschinen
en: Diamond cutting tools for machines

source: Membranpumpen zur Förderung von flüssigem Material
en: Diaphragm pumps for pumping liquid material

source: Lagerbrücken für Kugellager
en: Bearing brackets for ball bearings

source: Lagerbrücken für Rollenlager
en: Bearing brackets for roller bearings

source: Lager für Schaftkupplungen
en: Bearing to shaft locking devices

source: Teilehalter für Maschinen
en: Die holders for use with machines

source: Buchbindeapparate und -maschinen für industrielle Zwecke
en: Bookbinding apparatus and machines for industrial purposes

source: Kübelbahnen für Förderanlagen
en: Bucket rails for conveyors

source: Rotierende Schuhe [Maschinenteile]
en: Rotary shoes [parts of machines]

source: Elektrische Rotationsmaschinen
en: Rotating electrical machines

source: Verschließbare Ventile [Maschinenteile]
en: Lockable valves [parts of machines]

source: Pneumatische Antriebe für Maschinen und Motoren
en: Pneumatic controls for machines, motors and engines

source: Bremsen für Maschinen
en: Brakes for machines

source: Förderer für landwirtschaftliche und Gartenbaumaschinen sowie deren Teile und Bestandteile
en: Conveyors for agricultural and horticultural machinery and parts and fittings therefor

source: Dieselmotoren für Maschinen
en: Diesel engines for machines

source: Schneidköpfe [Maschinenteile]
en: Cutterheads [parts of machines]

source: Hydraulische Türschließer
en: Door closers, hydraulic

source: Elektrische Türöffner
en: Door openers, electric

source: Stoßdämpferfedern als Teile von Maschinenaufhängungen
en: Shock absorbing springs being parts of machine suspension

source: Präzisionswerkzeugmaschinen zur Bearbeitung von Werkstücken
en: Precision machine tools for machining workpieces

source: Präzisionstrennwerkzeuge [Maschinenteile]
en: Precision parting tools [parts of machines]

source: Elektrische Präzisionsschraubendreher
en: Precision screwdrivers (Electric -)

source: Präzisionsdrehwerkzeuge [Maschinenteile]
en: Precision turning tools [parts of machines]

source: Halbleiterbearbeitungsmaschinen zum Beizen von Magnetplatten
en: Semiconductor processing machines for etching magnetic disks

source: Elektrische Fleischwölfe
en: Power-operated meat grinders

source: Pneumatisch betriebene Hebevorrichtungen [Maschinen]
en: Pneumatically operated lifting jacks [machines]

source: Gewerbliche Maschinen für die Zubereitung von Nahrungsmitteln
en: Machines for the preparation of foodstuffs [industrial]

source: Elektrische Heftgeräte, ausgenommen für Bürozwecke
en: Staplers (Electric -), other than for office use

source: Selbstfahrende Straßenkehrmaschinen
en: Road sweeping machines, self-propelled

source: Druckpressen für keramisches Material
en: Printing presses for ceramic material

source: Ölkühler [Teile von Fahrzeugmotoren]
en: Oil coolers [vehicle engine parts]

source: Ölbehälter [Teile von Fahrzeugmotoren]
en: Oil tanks [vehicle engine parts]

source: Kraftbetätigte Heckenscheren
en: Power driven hedge shears

source: Abgasnachbehandlungsanlagen für Dieselmotoren
en: Exhaust gas treatment systems for diesel engines

source: Fußantriebe für Nähmaschinen
en: Pedal drives for sewing machines

source: Maschinenwerkzeuge zur Entnahme von Abfallmaterial
en: Machine tools for removing waste material

source: Viehmarkierungsgeräte [Maschinen]
en: Cattle marking tools [machines]

source: Hebevorrichtungen für Fahrzeuge
en: Lifts for use with vehicles

source: Rückschlagklappen aus Metall [Maschinenteile]
en: Non-return valves of metal [parts of machines]

source: Fleischschneider [elektrische Maschinen] für Haushaltszwecke
en: Meat cutters [electric machines] for household use

source: Mechanische Scheren [Maschinen]
en: Mechanical shears [machines]

source: Schleifscheiben [Werkzeugmaschinen]
en: Abrasive discs [machine tools]

source: Walzen als Maschinenteile
en: Cylinders being parts of machines

source: Milchzentrifugen [Maschinen]
en: Milk centrifuges [machines]

source: Carbidbohrer [Maschinenwerkzeuge]
en: Carbide burs [machine tools]

source: Planetengetriebe, ausgenommen für Landfahrzeuge
en: Planetary gear transmissions, other than for land vehicles

source: Rohrschneidewerkzeuge [Maschinen]
en: Tube cutting instruments [machines]

source: Pneumatisch gesteuerte automatische Ventile
en: Valves operated automatically by pneumatic control

source: Lader mit Raupenketten
en: Crawler-tracked loaders

source: Schneidemaschinen zur Metallbearbeitung
en: Cutting machines [for metalworking]

source: Mühlen für chemische Verfahren
en: Free-form forging machines

source: Düsenmotoren, ausgenommen für Landfahrzeuge
en: Jet engines, other than for land vehicles

source: Lager für Wellen
en: Bearings for shafts

source: Treibriemen, ausgenommen für Landfahrzeuge
en: Driving belts, other than for land vehicles

source: Gummistempel [Maschinenteile]
en: Rubber stamps [parts of machines]

source: Abfallverdichter [Maschinen]
en: Rubbish compactors [machines]

source: Sicherheitskupplungen [ausgenommen für Landfahrzeuge]
en: Safety couplings [other than for land vehicles]

source: Elektrische Parkettbohnergeräte
en: Parquet wax-polishers, electric

source: Elektrische Schuhputzgeräte
en: Shoe polishers, electric

source: Rotierende Bohrer [Maschinenteile]
en: Rotary drills [parts of machines]

source: Metallschneidewerkzeuge mit Diamantspitze
en: Diamond-pointed metal-cutting tools

source: Bohrkronen für Gesteinsbohrer
en: Drill bits for rock drilling

source: Eggen [traktorgezogene landwirtschaftliche Geräte]
en: Harrows [tractor towed agricultural implements]

source: Wasserpumpen für Duschen
en: Water pumps for showers

source: Scheibenförmige rotierende Schleifwerkzeuge [Maschinen]
en: Disc shaped rotating grinding tools [machines]

source: Metallschläuche zur Übertragung von hydraulischem Druck in Maschinen
en: Hoses (Metal -) for transferring hydraulic power in machines

source: Drehzahlregler [mechanisch] für Maschinen und Motoren
en: Speed governers [mechanical] for machines, engines and motors

source: Elektrische Türschließer
en: Door closers, electric

source: Hydraulikplattformen mit Eigenantrieb
en: Self-propelled hydraulic platforms

source: Rollenlager für Maschinen
en: Roller bearings for machines

source: Riemen für Schrumpfmaschinen
en: Belts for shrinkage machines

source: Biegepressen [Maschinen]
en: Bending presses [machines]

source: Numerisch gesteuerte Gewindeschneidmaschinen
en: Numerically controlled tapping machines

source: Numerisch positionierbare Universalfräsmaschinen als Werkzeuge
en: Numerically positioned universal milling machines for tooling

source: Prallbrecher [Maschinen oder Maschinenteile]
en: Impact crushers [machines or parts of machines]

source: Dampfkessel zur Dampferzeugung [Maschinenteile]
en: Steam boilers for steam generating [parts of machines]

source: Drehmomentwandler für Maschinen
en: Torque converters for machines

source: Industrieroboter für die Fertigung
en: Industrial robots for use in manufacture

source: Industrieroboter für die Bearbeitung von Werkstücken
en: Industrial robots for use in the handling of workpieces

source: Gewerbliche Vakuumiermaschinen für die Produktion
en: Industrial vacuum machines for use in manufacture

source: Sauggebläse zum Transport von Körnern
en: Suction fans for the carrying of grain

source: Saugmaschinen für Absaugzwecke
en: Suction machines for scavenging purposes

source: Pressmaschinen für die Montage von Schläuchen
en: Swaging machines for use in the assembly of hoses

source: Pressmaschinen für die Vorbereitung von Schlauchmontagen
en: Swaging machines for use in the preparation of hose assemblies

source: Formen für Druckguss [Maschinenteile]
en: Moulds for die-casting [parts of machines]

source: Stellmotoren für Spulen
en: Moving coil servomotors

source: Perforiermaschinen [zur Metallbearbeitung]
en: Perforating machines [for metalworking]

source: Kupplungen für landwirtschaftliche Geräte
en: Couplings for agricultural implements

source: Maschinen zum Sägen und Spalten von Brennholz
en: Power machines for cutting and splitting logs for firewood

source: Kreissägen für die Holzbearbeitung
en: Circular saws [for woodworking]

source: Automatische Türöffner [elektrisch]
en: Automatic door apparatus [electric]

source: Kugellagereinsätze [Maschinenteile]
en: Bearing inserts [machine parts]

source: Kugellager [Maschinenteile]
en: Roller bearings [machine parts]

source: Traubenpressen [Maschinen]
en: Wine presses [machines]

source: Mechanische Dichtungen [Maschinenteile]
en: Mechanical seals [machine parts]

source: Backenbrecher [Maschinen]
en: Jaw crushers [machines]

source: Schiebekeile [Teile von Getrieben von Wasserfahrzeugen]
en: Splines (sliding -) [parts of water vehicle gearing]

source: Absperrventile [Maschinenteile]
en: Stop valves [parts of machines]

source: Mehrzweckspindelköpfe zum Bohren [Maschinen]
en: Multiple spindle heads for use in drilling [machines]

source: Vollautomatische Füttergeräte für Nutztiere
en: Automatic feeding apparatus for livestock

source: Pumpen für die Entnahme von Dampf [Maschinen]
en: Pumps for the extraction of vapour [machines]

source: Pumpen für die Lebensmittelindustrie [Maschinen]
en: Pumps for use in the food industry [machines]

source: Maschinen zur Abdichtung von mit Lebensmitteln gefüllten Kartons
en: Machines for use in the sealing of cartons filled with food

source: Antriebe, ausgenommen für Landfahrzeuge
en: Drive units, other than for land vehicles

source: Antriebe zum Umwandeln von Drehbewegungen in Linearbewegungen [ausgenommen für Landfahrzeuge]
en: Drives for converting rotary motion to linear motion [other than for land vehicles]

source: Verteilerköpfe als Teile von Fahrzeugauspuffanlagen
en: Headers as part of vehicle exhaust system

source: Kondensatoren [Zündvorrichtungen für Verbrennungsmotoren]
en: Condensers [ignition parts for internal combustion engines]

source: Kolben [Teile von Verbrennungsmotoren]
en: Pistons [internal combustion engine parts]

source: Gelochte Trommeln als Teile von Maschinen für die Materialsortierung
en: Perforated drums being parts of machines for sorting materials

source: Permanentfutter [Maschinenteile]
en: Permanent chucks [parts of machines]

source: Bespannungsmaschinen für Trommeln
en: Pressurising machines for drums

source: Druckmaschinen für Leiterplatten
en: Printed circuit board forming machines

source: Bremsen für industrielle Zwecke für Industriewaschmaschinen
en: Industrial brakes for industrial washing machines

source: Teppichstaubsauger für gewerbliche Zwecke
en: Industrial carpet vacuuming machines

source: Elektrische Teigtrennmaschinen
en: Dough dividing machines (Electric -)

source: Elektrische Teigknetmaschinen
en: Dough kneading machines (Electric -)

source: Gartentraktoren zum Rasenmähen
en: Garden tractors for mowing lawns

source: Elektrische Knoblauchpressen
en: Garlic presses (Electric -)

source: Elektrische Drehumformer
en: Electrical rotary converters

source: Elektrische Winden für Segelboote
en: Electrical winches for sailboats

source: Unterbrechungsfreie Stromerzeugungsmaschinen
en: Uninterruptible power supply generating machines

source: Unbemannte Transportförderbänder
en: Unmanned transportation conveyors

source: Maschinen zur Verpackungsherstellung
en: Machines for manufacturing packaging materials

source: Maschinen zur Mineralaufbereitung
en: Machines for mineral processing

source: Kultivatoren [Maschinen]
en: Cultivators [machines]

source: Längsschneidemaschinen für gewerbliche Zwecke
en: Slitting machines for industrial use

source: Schlammhähne [Ventile] als Maschinenteile
en: Sludge cocks [valves] being parts of machines

source: Anschläge für Tischsägen
en: Saw fences for use on table saws

source: Geräteträger für Farbspritzgeräte
en: Supports for spray guns for paint

source: Balkensprüher [Maschinenteile]
en: Spreader beams [parts of machines]

source: Stanzmaschinen zum Ausstanzen von Teilen aus Metallplatten
en: Stamping machines for pressing out components from sheet materials

source: Stempelmaschinen, ausgenommen für Bürozwecke
en: Stamping machines, other than for office use

source: Radialzuführgeräte [Maschinen]
en: Radial feeders [machines]

source: Rampen als Maschinen
en: Ramps being machines

source: Ratschenmechanik [Maschinen]
en: Ratchet handles [machines]

source: Fixierer für Werkstücke [Maschinenteile]
en: Workpiece locators [parts of machines]

source: Schneckenräder für Maschinen
en: Worm wheels for machines

source: Antriebsriemen für Flugzeugantriebe
en: Drive belts for driving aircraft

source: Sägewerkzeuge für Sägemaschinen
en: Sawing tools for use with sawing machines

source: Siebdruckgeräte [Maschinen]
en: Screen printing apparatus [machines]

source: Kraftstoffpumpen für Landfahrzeuge
en: Fuel pumps for land vehicles

source: Nachschleifwalzen [Maschinen] zur Herstellung von Kunststoffpellets
en: Regrinding mills [machines] for producing plastic pellets

source: Maschinell bedienbare Bohrwerkzeuge
en: Boring tools operated by machines

source: Streckfolienverpackungsmaschinen zum Umhüllen von palettisierten Lasten mit Kunststoffmaterial
en: Stretch-wrapping machines for applying plastics material to palletised loads

source: Elektrische Kettensägen
en: Electric chain saws

source: Kantenformer zum Abschrägen [Maschinen]
en: Bevelled edge formers [machines]

source: Unterdruckspeicher als Teile von Verbrennungsmotoren
en: Vacuum accumulators for internal combustion engines

source: Numerisch gesteuerte Bohrmaschinen
en: Numerically controlled drilling machines

source: Maschinen für den Abbau von Gestein
en: Machines for excavating rock

source: Maschinen zum Füllen von Verpackungsbehältern
en: Machines for filling packaging containers

source: Binder [Maschinen] für Buchrücken, ausgenommen für Bürozwecke
en: Spine binders [machines], other than for office use

source: Keilwellenbits [Getriebeteile für Wasserfahrzeuge]
en: Spline shank bits [parts of gearing for water vehicles]

source: Maschinen zur Anbringung von Bördelrändern an Matratzenkanten
en: Machines for applying beading to edges of mattresses

source: Mähmaschinen [benzinbetrieben]
en: Mowing machines [petrol]

source: Walzen als Teile von Verpackungsanlagen [Maschinen]
en: Rollers being components of packaging lines [machines]

source: Ablassschrauben für Flüssigstoffe [Maschinenteile]
en: Discharge screws for liquid materials [parts of machines]

source: Scheiben aus Schleifmaterial [Maschinenteile]
en: Discs made of abrasive materials [parts of machines]

source: Raspelmaschinen für Haushaltszwecke
en: Grating machines for household use

source: Mit Druckluft betriebene Fettpressen
en: Grease guns operated by compressed air

source: Schleifer [Maschinen]
en: Grinders [machines]

source: Ankerwinden mit Motorantrieb
en: Motor driven windlasses

source: Maschinen zur mechanischen Bearbeitung von Postsendungen [für gewerbliche Zwecke]
en: Machines for the mechanical handling of items of post [industrial]

source: Glaserdiamanten als Maschinenteile
en: Glaziers' diamonds being parts of machines

source: Sprühlanzen als landwirtschaftliche Geräte
en: Spray lances being agricultural implements

source: Druckübersetzer [Maschinen]
en: Pressure intensifiers [machines]

source: Elektrische Fliesenschneider
en: Tile cutters [electric]

source: Mischer für Ofenreparaturmaterial
en: Mixers for furnace repair materials

source: Rotierende Fräsen [Maschinenteile]
en: Rotary milling cutters [parts of machines]

source: Rotierende Druckmaschinen [ausgenommen für Bürozwecke]
en: Rotary printing machines [other than for office use]

source: Verschleißplatten für Maschinen
en: Fixed machines for pressing asphalt

source: Kühlventilatoren für Fahrzeugmotoren
en: Machines for manufacturing joints

source: Dichtungen für Verbrennungsmotoren
en: Gaskets for internal combustion engines

source: Fräsmaschinen für Straßenbeläge
en: Pavement profilers [machines]

source: Bodensortiergeräte [Maschinen]
en: Soil grading apparatus [machines]

source: Schalldämpfer als Maschinenteile
en: Sound absorbers being parts of machines

source: Elektrische Miniaturschraubendreher
en: Miniature screwdrivers (Electric -)

source: Metalldichtungen für Rohre [Maschinenteile]
en: Joints for tubes (metal -) [parts of machines]

source: Kneter [elektrische Küchenmaschinen]
en: Kneaders [electric kitchen machines]

source: Aufzüge für Lasten
en: Elevators for materials

source: Bagger als fahrbare Maschinen
en: Excavators being moveable machines

source: Thermobindemaschinen [ausgenommen für Bürozwecke]
en: Thermal binding machines [other than for office use]

source: Thermische Impulsschweißmaschinen
en: Thermal impulse welding machines

source: Pflüge
en: Ploughs

source: Pneumatische Fettpressen
en: Pneumatic grease guns

source: Antriebswellen, ausgenommen für Landfahrzeuge
en: Transmission shafts, other than for land vehicles

source: Auf Schiffen montierte Dockkräne
en: Marine mounted dock cranes

source: Mechanische und pneumatische Fördermaschinen
en: Mechanical and pneumatic hoisting apparatus

source: Turbinenschaufeln als Teile von Gasturbinenmotoren
en: Turbine vanes being parts of gas turbine engines

source: Reibahlen [Maschinenteile]
en: Reamers [parts of machines]

source: Gebläse für Maschinenmotoren
en: Motorised fans for machines

source: Polierringe [Maschinenteile]
en: Polishing discs [parts of machines]

source: Brutapparate für Eier
en: Incubators for eggs

source: Lader zum Verpacken von Waren
en: Loaders for packing goods

source: Reibräder für Maschinen
en: Friction wheels for machines

source: Schneideisen für Maschinen
en: Shredders [machines] for waste

source: Zerkleinerer [Maschinen] für Abfall
en: Shredding machines for water closets

source: Krümmer [Maschinenteile]
en: Material compacting machines

source: Glaserdiamanten [Teile von Maschinen]
en: Glaziers' diamonds [parts of machines]

source: Kardenmaschinen zum Filzen
en: Felt carding machines

source: Futterschneidemaschinen [Futterhäcksler]
en: Fodder cutting machines [feed cutters]

source: Adapter für Werkzeugmaschinen
en: Adapters for machine tools

source: Adapter für Werkzeugbohreinsätze [Maschinenteile]
en: Adaptors for tool bits [parts of machines]

source: Belüftungspumpen für Teiche
en: Aeration pumps for ponds

source: Elektrische Schraubenzieher
en: Screwdrivers, electric

source: Holzgreifzangen [Maschinenteile]
en: Wood grippers [parts of machines]

source: Feilen [elektrische Werkzeuge]
en: Files [power-operated tools]

source: Filtermaschinen für die Abwasseraufbereitung
en: Filtering machines used in sewage handling
